# Требуется определить номер дня, на который общий результат спортсмена составить не менее b километров. Программа должна принимать значения параметров a и b и выводить одно натуральное число — номер дня.
distance = float(input("Введите количество километров в первый день: "))
distance_2 = float(input("Введите количество километров в крайний день: "))
day = 1
while distance_2 > distance:
    distance = distance + (distance / 10)
    day = day + 1
print(f"На {day}-й день спортсмен достиг результата — не менее {int(distance_2)} км.")

