# Пользователь вводит целое положительное число. Найдите самую большую цифру в числе. Для решения используйте цикл while и арифметические операци
x = int(input('Введите целое положительное число: '))
max = 0
while x>0:
    c = x % 10
    if c >= max: max = c
    x //= 10
print(max)
