# Задание №1 создать переменные и вывести на экран
name = 'Максим'
age = 22
print (f"Привет, я {name}, мне {age} года")

# Запросите у пользователя несколько чисел и строк и сохраните в переменные, выведите на экран

Your_name = input("Введите свое имя: ")
Your_age = input("Сколько вам лет? ")
print (f"Вас зовут {Your_name}, вам {Your_age} лет")
